# StairsAttrRiserTreadConnect Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsAttrRiserTreadConnect Property
ParameterTypeId Class See Also
---
"Riser to Tread Connection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsAttrRiserTreadConnect { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAttrRiserTreadConnect As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsAttrRiserTreadConnect {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace